BrunoRicci/DataloggerDHT22/Firmware/code_esp8266_dht22/src/main.cpp
Measurement getMeasurements(void){
  //Turns sensors on, take measurements, format them and return.
  Measurement m;
  dht22_sensor_1.begin();           //Initializes objects.
  dht22_sensor_2.begin();
  dht22_sensor_3.begin();
  dht22_sensor_4.begin();

  setSensorPower(ON);
  delay(1000);  
  //GET MEASUREMENTS
  m.timestamp=rtcmem.getCurrentTime();  //Put current timestamp
  m.id_sensor[0] = 1;   //Read sensor number from configuration file.
  m.id_sensor[1] = 2; 
  m.id_sensor[2] = 3; 
  m.id_sensor[3] = 4;
  m.temperature[0] = generateMeasurementValue(TEMPERATURE, dht22_sensor_1.readTemperature());
  m.temperature[1] = generateMeasurementValue(TEMPERATURE, dht22_sensor_2.readTemperature());
  m.temperature[2] = generateMeasurementValue(TEMPERATURE, dht22_sensor_3.readTemperature());
  m.temperature[3] = generateMeasurementValue(TEMPERATURE, dht22_sensor_4.readTemperature());
  m.humidity[0] = generateMeasurementValue(HUMIDITY, dht22_sensor_1.readHumidity());; 
  m.humidity[1] = generateMeasurementValue(HUMIDITY, dht22_sensor_2.readHumidity());; 
  m.humidity[2] = generateMeasurementValue(HUMIDITY, dht22_sensor_3.readHumidity());; 
  m.humidity[3] = generateMeasurementValue(HUMIDITY, dht22_sensor_4.readHumidity());;  

  setSensorPower(OFF);

  return(m);
}

String generatePOSTRequest( void* data, uint16_t packets){
  /*This function receives data saved to flash (array) and generates the POST request to send
    it to the server, which is returned.
    Necessary data:
  */
  
  String request="";  //Initialize empty string.
  String values_timestamp=  "[";
  String values_id_sensor=  "[";
  String values_temperature="[";
  String values_humidity=   "[";

  Measurement m;  //Temporary variable.
  for (uint16_t p = 0; p < packets; p++){ //For each packet...
    memcpy(&m, data+(p*sizeof(m)), sizeof(m));    //Copies one packet into the temporary memory.

    for (uint8_t s = 0; s < DATALOGGER_SENSOR_COUNT; s++){ //For each sensor...
      values_timestamp+= (String)m.timestamp;
      values_id_sensor  +=(String)m.id_sensor[s];
      values_temperature+=(String)m.temperature[s];
      values_humidity   +=(String)m.humidity[s];

      if( p < packets-1){   //If it is not the last packet...
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
      }
      else{   //If it is the last element, closes the bracket.
        if(s < DATALOGGER_SENSOR_COUNT - 1){
          values_timestamp+=  ",";          
          values_id_sensor+=  ",";
          values_temperature+=",";
          values_humidity+=   ",";
        }  
        else{
          values_timestamp+=  "]";      
          values_id_sensor+=  "]";      
          values_temperature+="]";      
          values_humidity+=   "]"; 
        } 
      }
    }
  }
  
  request += "id_transceiver=1";      //? symbol deleted as it is not needed into POST method.
  request += "&battery_level="+(String)getBatteryLevel();
  request += "&timestamp="+   values_timestamp;
  request += "&id_sensor="+   values_id_sensor;
  request += "&temperature="+ values_temperature;
  request += "&humidity="+    values_humidity; 
  
  Serial.print("\n Generated POST request: ");
  Serial.println(request);  
  
  return request;
}

uint16_t sendMeasurements(uint16_t packets){
  /*
      This function takes data packets and sends them to the server.
      "packets" default value is 0, so if not specified in function call, it will send all the
      pending packets instead of the amount specified. 
  */
  uint32_t start_time = millis();
  bool isconnected=false;
  uint8_t buf[sizeof(Measurement) * MAX_PACKET_PER_REQUEST];    //Reserves temporary memory for data read from archive.
  uint16_t start_packet, end_packet, total_packets, next_packet;

  total_packets = rtcmem.rwVariables().archive_saved_pointer-1 - rtcmem.rwVariables().archive_sent_pointer-1;
  start_packet = rtcmem.rwVariables().archive_sent_pointer-1;
  
  if(packets == 0 || packets >= total_packets){ //If not specified or wrongly specified...
    packets = total_packets;  //Difference between saved pointer and sent pointer (maximum of packets).
  }
  end_packet = start_packet + packets;


  wifiTurnOn();
  Serial.setDebugOutput(true);
  WiFiMulti.addAP(config_globals.server_ap_ssid, config_globals.server_ap_pass);  //Connects to WiFi network.
  
  Serial.print("\nConnecting to server...\n ");
  while(millis() - start_time <= config_globals.connection_timeout || isconnected){
    
    if ((WiFiMulti.run() == WL_CONNECTED)) {
      Serial.printf("\nWiFi Connected!");
      isconnected=true; //Toggle flag.
      
      WiFiClient client;
      HTTPClient http;

      //Generate full URL.
      String url = "http://"+(String)config_globals.server_ip+":"+(String)config_globals.server_port;
      url+=SEND_MEASUREMENTS_URL;
      Serial.print("\n url: ");   Serial.println(url);

      Serial.print("\n[HTTP] begin...\n");
      if (http.begin(client, url)) {  //IF connected to server...
        

        next_packet = start_packet;
        do{
          
          next_packet;
        }while(next_packet > end_packet);



        //For each request...
        for (uint16_t p = start_packet; p < end_packet; p+=MAX_PACKET_PER_REQUEST)  //p should increase in terms of MAX_PACKET_PER_REQUEST!!!
        { 
          if(p >= end_packet)
            p = end_packet;

          archiveRead(buf, start_packet, start_packet+MAX_PACKET_PER_REQUEST);  //Read 24 measurements...
          String request = generatePOSTRequest(buf, MAX_PACKET_PER_REQUEST);
        
        
          Serial.print("[HTTP] POST...:\n");  Serial.print(request);
          int httpCode = http.POST( request );    //Send POST request.

          if (httpCode > 0) { // httpCode will be negative on error
            // HTTP header has been send and Server response header has been handled
            Serial.printf("[HTTP] POST... code: %d\n", httpCode);
            
            // file found at server
            if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
              String payload = http.getString();  Serial.println(payload);
            }
          } 
          else{
            Serial.printf("[HTTP] GET failed, error: %s\n", http.errorToString(httpCode).c_str());
          }
        
